Norbi76/tinywhoop3/telemetry_module/sdkconfig.defaults
# Telemetry module (XIAO ESP32-S3 Sense) build defaults.
# This file is authoritative; sdkconfig is generated from it and is gitignored.

CONFIG_IDF_TARGET="esp32s3"

# ---------------------------------------------------------------------------
# Flash and partitions: 8 MB flash, 4 MB app partition.
# ---------------------------------------------------------------------------
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ---------------------------------------------------------------------------
# SPIRAM: the XIAO ESP32-S3 Sense carries 8 MB of OCTAL PSRAM (ESP32-S3R8).
# The camera cannot work without it - a single UXGA JPEG frame buffer will not fit in the
# 512 KB of internal SRAM alongside the Wi-Fi stack.
# MODE_OCT is specific to this module; a board with quad PSRAM would fail to boot with this.
# ---------------------------------------------------------------------------
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Keep small allocations in fast internal RAM; only large buffers (frame buffers, the SD write
# staging buffer) go out to PSRAM, which is much slower.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# Cache sizing recommended for camera use on the S3.
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y

# ---------------------------------------------------------------------------
# Scheduler and CPU.
# 1000 Hz tick so the 50 Hz UART TX cadence is exact rather than quantised to 10 ms steps.
# ---------------------------------------------------------------------------
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# ---------------------------------------------------------------------------
# Wi-Fi: tuned for control latency, not throughput.
# Power save is disabled again at runtime in wifi_ap.c - this is belt and braces.
# ---------------------------------------------------------------------------
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y

# ---------------------------------------------------------------------------
# HTTP server. The dashboard posts at 20 Hz and the embedded page is served in one go.
# ---------------------------------------------------------------------------
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# ---------------------------------------------------------------------------
# FATFS for the SD card. Long filenames on the heap so numbered JPEG names are not truncated.
# ---------------------------------------------------------------------------
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255

# The camera and SD init both take a while; keep the watchdog generous during boot.
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

CONFIG_COMPILER_OPTIMIZATION_PERF=y
